/* eslint-env browser, es2020 */
/*! OrderHub — Data/Options (ORDER_OPTIONS) */
;
(function(w) {
    'use strict';
    /*
    cType : 客戶類型
    platforms : 接單平台
    isDelivery : 是否已付款
    isPay : 是否已交貨
    payType : 付款方式
    pCat : 品項分類
    pFor : 購買用途
    receiptType : 取貨方式
    */
    w.ORDER_OPTIONS = {
        orderStatus: ["doing", "done", "cancel"],
        cType: ["新客", "複購", "親友", "員工", "公關", "合作"],
        platforms: ["IG","LINE","MH","FB","官網","廣告","表單","市集","快閃","電話","面談","Google","email","OT","JG"],
        isDelivery: ["未交貨", "已交貨", "不交貨", "部分交"],
        isPay: ["未付款", "已付款", "公關", "已退款", "付訂金"],
        payType: ["匯款", "現金", "信用卡", "連結付", "卡緊收", "LINE P", "FREE"],
        pCat: ["週花", "花材", "花束", "花籃", "花蛋糕", "花製作物", "盆器", "盆花", "桌花", "植栽", "蘭花", "週邊", "課程", "婚禮物", "捧花", "佈置-婚禮", "佈置-空間", "其他資材", "擺攤", "活動-內部", "活動-外部", "Lifestyle", "品牌活動"],
        pFor: ["開幕", "開展", "喬遷", "入厝", "送禮", "求婚", "升遷", "轉職", "結婚登記", "結婚婚宴", "治喪", "抓周", "紀念日", "結婚紀念日", "告別式", "慶祝", "生日", "畢業", "拜拜", "感謝", "道歉", "攝影", "辦公室", "企業禮", "其他節日", "節日-年節", "節日-情人節", "節日-母親節", "節日-父親節", "節日-端午節", "節日-萬聖節", "節日-聖誕節", "異業合作", "佈置", "佈置-早宴", "佈置-午宴", "佈置-晚宴", "佈置-季節", "佈置-定期", "公關", "品牌活動"],
        receiptType: ["配送", "宅配", "郵寄", "佈置", "擺攤", "課程", "活動", "自取-其他", "自取-MH", "自取-OT", "自取-C2", "自取-JG", "自取-NS", "711店到店"],
    };

    // 取貨方式 → 預設地址 對應
    w.MAPPING_receiptType = {
        "自取-MH": "宜蘭縣頭城鎮新興路83號",
        "自取-NS": "臺北市大安區忠孝東路四段248巷15號",
        "自取-OT": "臺北市內湖區金湖路356號",
        "自取-C2": "臺北市中正區忠孝西路一段70號1樓"
    };
})(window);